{"video_id": "5RSsr-MagHw", "author": "@ElephantsRTasty", "comment_id": "UgyE4XOXlV5boRKLpQl4AaABAg", "like_count": 41, "reply_count": 1, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": true, "comment": "HEY GUYS! I am glad this video has already helped a few people out :) I got one more anonymous response to my survey after I had filmed this video, and I wanted to add it here in case it helped anyone out:\nMAJOR: Mechanical Engineering\nUndergrad experience overall: Lonely and isolating. I did not enjoy college and felt guilty for not appreciating the opportunity to have higher education the way I should. I felt trapped in my decisions financially and in terms of future outlook. \nAcademic experience: A professor /= a teacher. Some professors are better than others. I did not find the courses difficult, but that the burden of learning is more on the student than previously. For many classes the learning of material occurs outside of class on your own, not in class.\nExtracurricular experience: I did not participate in any extracurricular activities. Entirely my fault not RPI's. I wanted to join clubs but had a hard time doing so.\nCollege living experience: I had wonderful roommates throughout my college experience. Dining halls were okay, dorms were okay, nothing especially good or bad.\nCosts of attendance: I think I could acquire the same level of knowledge from a much less expensive school. The true determination of worth for me at this point is whether the RPI name can help in getting a job. Thus far I do not believe the cost of RPI is worth it.\nAdministration: I am not the most knowledgeable about issues the student body and administration have. I did not participate in Greek life or any clubs or sports and I was a class before the Arch became required so I have not been directly impacted by the decisions of the administration. That doesn't mean that students aren't being impacted by the administration or that the administration is doing a good job. I am just ignorant regarding the situation and thus I don't think I have a meaningful opinion to provide on the topic.\nPandemic response: I think it was a difficult situation to handle. I was lucky to have off-campus housing and was not quite as impacted as some by RPI's response. I think RPI did a good job at deciding to shut down campus quickly. I think RPI could have handled choosing to move out and executing student moveout better. In terms of financials I do not yet have a full understanding of RPI's plan. For classes I would say that the transition has not been the smoothest but everyone is doing their best and I do not fault RPI for how online classes are being executed.\nTroy, NY: I think that there are nice things about Troy and surrounding areas as well as not so nice things, just as every area has.\nOther: My views of RPI and my college experience are most probably influenced by my mental health issues, bipolar and social anxiety, so anything I say is not necessarily representative of RPI, but just my individual experiences. Though I suppose this is true whether or not there are mental health issues. Anyway just know to take what I say with a grain of salt."}
{"video_id": "5RSsr-MagHw", "author": "@MrYr2011", "comment_id": "UgyE4XOXlV5boRKLpQl4AaABAg.984bFC43wNq9AQn48DjrMK", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgyE4XOXlV5boRKLpQl4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Alpha Phi Omega - community service fraternity at RPI used to be located upstairs  in the Student Union - an option worth exploring if one is not drawn toward conventional Greek fraternity culture."}
{"video_id": "5RSsr-MagHw", "author": "@rh1128", "comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg", "like_count": 81, "reply_count": 9, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "me watching this after committing to RPI... :O"}
{"video_id": "5RSsr-MagHw", "author": "@isagonzalez6704", "comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg.98A_v5hJkTL99B1jrWRRi6", "like_count": 1, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "same lol!"}
{"video_id": "5RSsr-MagHw", "author": "@brandonklein1", "comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg.98A_v5hJkTL99gWZTlIZ2j", "like_count": 16, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Hey please take this all with a grain of salt. The vast majority of complaints people have are over finances (which of you have committed, you would have considered), and administration. Literally any college experience in existence requires yourself to 'put yourself out there' to get nested into social groups and a sense of community. I'm sure you all will have a great time, but like any school, if you want to get involved, you have to push for it. Administration is a hot spot, and since the pandemic, many students are now actually affected by administration decisions, however, aside from major and uncontrollable events like that, admin does NOT affect your day to day life. Most of the people vocal about the school are the ones who for one reason or another have issues, but the vast majority of students really like it."}
{"video_id": "5RSsr-MagHw", "author": "@haltersweb", "comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg.98A_v5hJkTL99jHf9l2Tvu", "like_count": 14, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Both of my children are at RPI (sophomore and junior) and are thriving.  My son and daughter are both math majors and my son is also doing ROTC.  Both are working on minors as well, one is getting a psych minor and one is getting a business (and possibly an art minor).  They are running a 3.5 and a 3.6 GPA.\n\nThey are both involved in Greek Life and extracurricular activities.  This has not only helped to round out their college experience but has also increased their course performance (especially Greek life — lots of people to study with and to help you). In fact students involved in Greek life at RPI have a higher average GPA.\n\nClasses are definitely hard, but both of my kids are on track to graduate on time.  Each of my kids only transferred one or two AP courses, and decided to retake others such as Calc and Physics which they could have APd out of.  Both of them are glad they retook these courses due to the rigor expected.\n\nThe key to doing well at RPI is to know how to advocate for yourself, be disciplined, and be a good time manager.  I also went to RPI and crashed and burned because I was undisciplined and immature.  It wasn’t the fault of the institution, it was my fault.  Watching how well my children are thriving at RPI is a real testament to the value of hard work and discipline.\n\nRPI is highly regarded in the tech and engineering industry as well as among elite colleges (one of my son’s fraternity brothers is now pursuing his masters degree at MIT.)\n\nUltimately you get out what you put in.  I hope you enjoy your tenure at RPI."}
{"video_id": "5RSsr-MagHw", "author": "@addiowl8538", "comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg.98A_v5hJkTL9B261KNXvrB", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "lmao same."}
{"video_id": "5RSsr-MagHw", "author": "@stormyweraf7923", "comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg.98A_v5hJkTL9B6jYxTtAOk", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Bro same"}
{"video_id": "5RSsr-MagHw", "author": "@rickmortar7886", "comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg.98A_v5hJkTL9K7SSvDQ-9S", "like_count": 4, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": " @brandonklein1  RPI students are extremely cringe.  Never in my life have I been around so many socially inept people who didn't bathe."}
{"video_id": "5RSsr-MagHw", "author": "@brandonklein1", "comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg.98A_v5hJkTL9K7wrV81Rq6", "like_count": 3, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": " @rickmortar7886  Man I really just have to clue what you're talking about. I have met none of those people in my 3 years here, but I am sorry if you have."}
{"video_id": "5RSsr-MagHw", "author": "@bigpooper4156", "comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg.98A_v5hJkTL9Ttj7We7GH2", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": " @rickmortar7886  Damn bro didn't have to go that hard lmao"}
{"video_id": "5RSsr-MagHw", "author": "@janiceluu4561", "comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg.98A_v5hJkTL9_UYOI9kmoo", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgzxbVgsD3wqwMFeb2B4AaABAg", "published_date": "1 year ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "What is your experience there after 1 year?  Is it lonely and not set up for social interactions?"}
{"video_id": "5RSsr-MagHw", "author": "@bubbletea8793", "comment_id": "Ugxy8x6GPAN3IcpR7Xx4AaABAg", "like_count": 15, "reply_count": 2, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Hello! Thank you so much for this video. Commitment fees are due this Friday and I was debating between RPI and a few other colleges. The thing that appealed to me most about RPI was it being well known for its rigorous courses in the STEM field (I plan on majoring in CS), however, as I did more research on RPI I uncovered awful things that the president and the administration has done, I am so sorry for current and past RPI students who had to deal with it. That made me uneasy but despite that I was still considering the school because of its great education and overall statistics. However, this video has helped me to realize that RPI is going downhill because of the negligence of the administration and president. I would never want to commit to a school that doesn't recognize its students needs and or mental health. Thank you again for this video you helped me a lot."}
{"video_id": "5RSsr-MagHw", "author": "@ElephantsRTasty", "comment_id": "Ugxy8x6GPAN3IcpR7Xx4AaABAg.982fGb2G_IF9831z40x58q", "like_count": 5, "reply_count": 0, "is_reply": true, "parent_comment_id": "Ugxy8x6GPAN3IcpR7Xx4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": true, "comment": "You are very welcome, I am so glad this video has helped. I wanted to get it out this week because of the commitment deadline lol! I wish it could have been out sooner, but oh well. Like I mentioned in the video though, my video is not the only source out there regarding RPI and some people have different opinions than me, so I am glad to hear that you have done additional research on RPI. I wish you all the best on your college journey!! :)"}
{"video_id": "5RSsr-MagHw", "author": "@bubbletea8793", "comment_id": "Ugxy8x6GPAN3IcpR7Xx4AaABAg.982fGb2G_IF98362ZMzhKV", "like_count": 2, "reply_count": 0, "is_reply": true, "parent_comment_id": "Ugxy8x6GPAN3IcpR7Xx4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "sunny thank youu!!"}
{"video_id": "5RSsr-MagHw", "author": "@carolfrederick4993", "comment_id": "UgyLcq316LySts4akBh4AaABAg", "like_count": 11, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Thank you! My daughters are seniors in HS and one of them has completed her application to RPI. Your information on the financial condition of the school and administrative issues is enlightening. I never thought to look at that when considering which school to attend.  My eyes are now wide open! Thank you again."}
{"video_id": "5RSsr-MagHw", "author": "@daric_", "comment_id": "Ugy_sq-wH3X97qKTekB4AaABAg", "like_count": 2, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "1 year ago (edited)", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Thanks for your video and being open about your experiences. Prospective undergrads need to hear these things.\n\nAs a PhD student, a lot of the problems (high costs of undergraduate school, the ARCH program, cutting down on funding for groups and stuff, etc.) didn't apply to me (my projects paid for tuition, I didn't have to do ARCH or live on campus, etc). So I guess I got lucky that way. It's also why I'm glad I only came to RPI as a graduate student whose tuition was completely waived (with only a few fees for insurance and other things having to be paid each semester out of pocket) and receiving a stipend.\n\nI felt bad for the undergrads who told me about the stuff they had to go through. But the academics for RPI at all levels seem to be really solid. It's just too bad the school's reputation is dragged down by all the other junk. But hey, there's going to be a new president, so maybe it will get better?"}
{"video_id": "5RSsr-MagHw", "author": "@sajinijoby5063", "comment_id": "UgzjuaeHcxRpllV1lpN4AaABAg", "like_count": 3, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "1 year ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "This was extremely helpful. Really appreciate the brutal honesty. We recently toured RPI for my son and this video definitely put things in perspective"}
{"video_id": "5RSsr-MagHw", "author": "@alaharon1233", "comment_id": "UgxLvlzTFNvwBVz1C9l4AaABAg", "like_count": 7, "reply_count": 1, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago (edited)", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Something to take into account is how RPI is much less selective now in its quest to raise enrollment. So students considering RPI are not likely to be comparing it to the institutions you quoted as peer institutions, but rather to lower tier schools where it likely does shine. Ultimately as you say, price is one of the biggest factors. As a community college transfer student, I haven't yet received decisions for my top choice schools, but if I can negotiate better aid from RPI, it's still close behind despite the criticisms in this video because the job outcomes, student body, clubs, and faculty are really appealing to this nerd"}
{"video_id": "5RSsr-MagHw", "author": "@ElephantsRTasty", "comment_id": "UgxLvlzTFNvwBVz1C9l4AaABAg.980tVwZNpay982-t-SUIRK", "like_count": 3, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgxLvlzTFNvwBVz1C9l4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": true, "comment": "Personally I think it reflects poorly on RPI that it is now being compared to lower tier schools. If you still love the idea of going to RPI, that’s great! Some parts of it like I said in the video are still good and appealing to many students. I wish you all the best :)"}
{"video_id": "5RSsr-MagHw", "author": "@thecomputernerd020", "comment_id": "UgzFaHA6_lD6Ydb-VP54AaABAg", "like_count": 29, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Current computer science undergrad here. I cant speak for any other schools within rpi, but graduating in 3-4 years with less than 16 transfer credits is 100% possible. This school is hard, ap credits will help but they shouldnt define your experience :)"}
{"video_id": "5RSsr-MagHw", "author": "@s-jk5578", "comment_id": "UgzxaSM3HPgxWAVINY14AaABAg", "like_count": 4, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "I am SO very grateful to have come across this informative video. Hearing about the administration's incompetence etc and money focused schemes that you have highlighted was eye awakening! We will NoT be applying to this place!"}
{"video_id": "5RSsr-MagHw", "author": "@emilybrickeridge4059", "comment_id": "Ugzv-_DTon_7jeS2E6N4AaABAg", "like_count": 4, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "1 year ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Thanks so much for all of the information in this video, it's more informative than any other college videos I've come across. You really helped me dodge a bullet. 😅"}
{"video_id": "5RSsr-MagHw", "author": "@lyconxero457", "comment_id": "UgzcozUia2IiCjab6St4AaABAg", "like_count": 11, "reply_count": 1, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "This reminds me of my college experience except you actually feel like you got a good education in the end and I did not. My school mislead me in how detailed their programs were as it related to my major to the point that I had to go elsewhere later to re-educate myself on all the things I didn’t learn during my undergrad."}
{"video_id": "5RSsr-MagHw", "author": "@ElephantsRTasty", "comment_id": "UgzcozUia2IiCjab6St4AaABAg.98-kWbqwajo98-nwDFm0X5", "like_count": 5, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgzcozUia2IiCjab6St4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": true, "comment": "im sorry to hear that :("}
{"video_id": "5RSsr-MagHw", "author": "@Andreinadlc", "comment_id": "UgxNrHMa1L6LA_ogK5F4AaABAg", "like_count": 2, "reply_count": 1, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Thank you Sunny for this video. I’m a prospective ME transfer student so if I will be attending it’ll be Bc of the great amount of financial aid I’m receiving. Also, is it possible you could share the contact of the female mechanical engineer student that shared her testimony so that I can ask more specific questions? Thank you"}
{"video_id": "5RSsr-MagHw", "author": "@ElephantsRTasty", "comment_id": "UgxNrHMa1L6LA_ogK5F4AaABAg.982BdrCG-SY982XMG8dpay", "like_count": 3, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgxNrHMa1L6LA_ogK5F4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": true, "comment": "You are very welcome and I wish you the best with everything! Unfortunately that survey response was anonymous so I do not have their contact information. Sorry :("}
{"video_id": "5RSsr-MagHw", "author": "@luciamorton8245", "comment_id": "UgyDm_MWV8R8NkhJ5Z14AaABAg", "like_count": 0, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "9 months ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "You’ve saved me so much time, wish you went to every school I’m applying to. Thank you!!!"}
{"video_id": "5RSsr-MagHw", "author": "@joelin4188", "comment_id": "UgwxQ2ZV6gGSjInI2uV4AaABAg", "like_count": 5, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "I love your video!! It helps me a lot to determine my ED school"}
{"video_id": "5RSsr-MagHw", "author": "@aliciamoss9547", "comment_id": "UgznM4WsuZwAqPnN2VZ4AaABAg", "like_count": 8, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago (edited)", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Going to a community college and transferring in will definitely save money but I would just like to add that they still make all transfer students live on campus their first year even though they are transferring in as juniors. Another money grab of course."}
{"video_id": "5RSsr-MagHw", "author": "@MrJazzman24", "comment_id": "Ugykf0QmCWe5SUXHH_Z4AaABAg", "like_count": 1, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "I’m about to apply to RPI’s Architectural Acoustics Grad program. Any opinions on the program?"}
{"video_id": "5RSsr-MagHw", "author": "@ARULKS66", "comment_id": "UgyKJ5b_oVsDqOfxaBp4AaABAg", "like_count": 1, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "1 year ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Education is high quality! That’s all it matters!!"}
{"video_id": "5RSsr-MagHw", "author": "@noahlape8187", "comment_id": "UgyFVf-bkCrxymmMQ6t4AaABAg", "like_count": 4, "reply_count": 1, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "I was at RPI for one year, and while yeah. The administration does suck, the student life was pretty good, i thought the dinning halls are pretry nice. And for the most part the teachers are great"}
{"video_id": "5RSsr-MagHw", "author": "@avpthegreat", "comment_id": "UgyFVf-bkCrxymmMQ6t4AaABAg.9BM90gzPH-U9TwHOZl5hz_", "like_count": 1, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgyFVf-bkCrxymmMQ6t4AaABAg", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Only decent one I found was Sage, and even that was bare minimum for my taste. I couldn’t stand eating anywhere else."}
{"video_id": "5RSsr-MagHw", "author": "@tatianastewart4831", "comment_id": "UgyLvCqa-KX_z9sIVgR4AaABAg", "like_count": 5, "reply_count": 1, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Wow I literally just committed a few days ago but deferred my enrollment for spring. They offered me $40,000(more than every school I applied to) but it wasn’t my first choice (4th or 5th choice) because it seemed like more of a technology/engineering school and I want to major in business. It also doesn’t seem too diverse. I don’t know what to do now ):"}
{"video_id": "5RSsr-MagHw", "author": "@bneema2001", "comment_id": "UgyLvCqa-KX_z9sIVgR4AaABAg.99sksa6ajgN9AMz4pG1LZ6", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgyLvCqa-KX_z9sIVgR4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Don't feel too bad. Just stick it out for a semester or two and if you don't like it, you can transfer out. It is very STEM based but for the most part people won't shit on you if you're not majoring in STEM.\n\nAlso, I think you can just tell them that you don't want to commit anymore. But you won't get your money back."}
{"video_id": "5RSsr-MagHw", "author": "@medogerty6013", "comment_id": "Ugw1EgBbGQcFVqt6zcx4AaABAg", "like_count": 52, "reply_count": 2, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Her: casually states “it can be pretty cold in the winter. Sometimes it’ll be as low as -10 degrees” like it’s nothing\n\nMe from California: 😳"}
{"video_id": "5RSsr-MagHw", "author": "@generalgrevious8645", "comment_id": "Ugw1EgBbGQcFVqt6zcx4AaABAg.9E0QKlN1Zni9Ge3pLrC77d", "like_count": 6, "reply_count": 0, "is_reply": true, "parent_comment_id": "Ugw1EgBbGQcFVqt6zcx4AaABAg", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "I'm from Nigeria and I'm going to RPI"}
{"video_id": "5RSsr-MagHw", "author": "@medogerty6013", "comment_id": "Ugw1EgBbGQcFVqt6zcx4AaABAg.9E0QKlN1Zni9GiZSfmx5C7", "like_count": 4, "reply_count": 0, "is_reply": true, "parent_comment_id": "Ugw1EgBbGQcFVqt6zcx4AaABAg", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "General Grevious Well damn that’s much hotter there. At the time I wrote this tho California was on fire"}
{"video_id": "5RSsr-MagHw", "author": "@jonn_mace_80_95_", "comment_id": "Ugw0AlyQ5J-nvLkN5xt4AaABAg", "like_count": 6, "reply_count": 2, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Power to the tuition paying students!"}
{"video_id": "5RSsr-MagHw", "author": "@jonn_mace_80_95_", "comment_id": "Ugw0AlyQ5J-nvLkN5xt4AaABAg.984ugXblGAT99BJ_15eS12", "like_count": 1, "reply_count": 0, "is_reply": true, "parent_comment_id": "Ugw0AlyQ5J-nvLkN5xt4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "kcotte59 A lot of college students work part time (some of them even fill time) to pay for the school expenses."}
{"video_id": "5RSsr-MagHw", "author": "@bassiroudiop3283", "comment_id": "Ugw0AlyQ5J-nvLkN5xt4AaABAg.984ugXblGAT9At7K99nSxL", "like_count": 4, "reply_count": 0, "is_reply": true, "parent_comment_id": "Ugw0AlyQ5J-nvLkN5xt4AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "i got a full ride to rpi engineering in aerospace engineering as a sophomore transfer student, but I’m a little afraid to commit, because I haven’t heard a lot of great experiences."}
{"video_id": "5RSsr-MagHw", "author": "@Sundji", "comment_id": "UgxoZ_5JJuibV1jdrwt4AaABAg", "like_count": 8, "reply_count": 3, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "I hated my experience at RPI. I only stuck it out because recruiters seem to swoon at the name. Especially as a black student, being at RPI was devastating for my mental health and self esteem."}
{"video_id": "5RSsr-MagHw", "author": "@bigpooper4156", "comment_id": "UgxoZ_5JJuibV1jdrwt4AaABAg.9IhzAYwfRi99TtjHwSPYVn", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgxoZ_5JJuibV1jdrwt4AaABAg", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Damn, was there racial discrimination going on?"}
{"video_id": "5RSsr-MagHw", "author": "@avpthegreat", "comment_id": "UgxoZ_5JJuibV1jdrwt4AaABAg.9IhzAYwfRi99TwH6EQzmgp", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgxoZ_5JJuibV1jdrwt4AaABAg", "published_date": "2 years ago (edited)", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Same experience, except I am Latino from NYC. Everyone was chill here, then I moved to Troy and was met with a completely different social scene. I never adapted after four years here and suffered crippling depression and anxiety since."}
{"video_id": "5RSsr-MagHw", "author": "@Sundji", "comment_id": "UgxoZ_5JJuibV1jdrwt4AaABAg.9IhzAYwfRi99TwJspK86xF", "like_count": 2, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgxoZ_5JJuibV1jdrwt4AaABAg", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": " @bigpooper4156  There were incidents of students carrying racist sentiments. There were also times where the institution itself was glaringly racially insensitive. They got rid of a lot of the multicultural institutions in the school that were specifically meant to help people of color adjust to going to school there. There are various reasons why people of color need assistance when going to pwis but RPI doesn't seem as committed to creating that space as they say they are. Overall the biggest issue was just how depressing it was being there and being the only black kid in half your classes doesn't help with that."}
{"video_id": "5RSsr-MagHw", "author": "@pappabear4977", "comment_id": "UgywggLN777A4SDITWJ4AaABAg", "like_count": 1, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "1 year ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Your video is very kind to RPI regarding its campus quality of life.  I personally wouldn’t recommend it at all."}
{"video_id": "5RSsr-MagHw", "author": "@Willwrz", "comment_id": "UgxSqmeqyZK8wHlupIN4AaABAg", "like_count": 7, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "34:54 Now I understand why I received so many emails from them, mentioning ED2 deadlines and actually extended it for a few days when I did not apply before the first deadline..."}
{"video_id": "5RSsr-MagHw", "author": "@justahologram2230", "comment_id": "UgxaFDmBECqV2fyegB14AaABAg", "like_count": 2, "reply_count": 3, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "I'm surprised you didn't transfer out for postgrad"}
{"video_id": "5RSsr-MagHw", "author": "@ElephantsRTasty", "comment_id": "UgxaFDmBECqV2fyegB14AaABAg.98-lpe_MO-498-nsxzkGq4", "like_count": 5, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgxaFDmBECqV2fyegB14AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": true, "comment": "Honestly I am staying for convenience and because I get decent financial aid + wont be in debt afterwards"}
{"video_id": "5RSsr-MagHw", "author": "@justahologram2230", "comment_id": "UgxaFDmBECqV2fyegB14AaABAg.98-lpe_MO-49808YgBarVQ", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgxaFDmBECqV2fyegB14AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": " @ElephantsRTasty  P.S. it sucks that NY won't let you take your safety more seriously considering how dangerous that area is"}
{"video_id": "5RSsr-MagHw", "author": "@jonmetes8954", "comment_id": "UgxaFDmBECqV2fyegB14AaABAg.98-lpe_MO-49CCptdgaaEm", "like_count": 1, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgxaFDmBECqV2fyegB14AaABAg", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "When I was at RPI, we were there to study - not to protest or demonstrate.  Academic standards were very high and discipline was required for us to concentrate on getting through a demanding curriculum (letting  off steam Saturday nights, of course). Do today's students have perhaps too much extra time on their hands?\nJon Metes (RPI BS Jan '59)"}
{"video_id": "5RSsr-MagHw", "author": "@rockyroad3665", "comment_id": "Ugzr9aSuzYceoHJdMzl4AaABAg", "like_count": 0, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Thank you for this video.  Great info."}
{"video_id": "5RSsr-MagHw", "author": "@MarkVA71", "comment_id": "UgxeiGBaR-Ppj7BNEHJ4AaABAg", "like_count": 0, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "1 month ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "I was leaving a comment about my experiences at RPI in the late 1990s as a grad student there but then I heard you getting into gender diversity. You can't force women to like or want to go into engineering or related fields. It's not a very nurturing field. As a gay man I was very happy with the 5 to 2 men to women ration. Plenty of eye candy but unfortunately too many eye sore Karens like yourself!"}
{"video_id": "5RSsr-MagHw", "author": "@lesrenebrowne3438", "comment_id": "UgwmM21UBbl8yzAV-EN4AaABAg", "like_count": 0, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "This was very helpful thanks"}
{"video_id": "5RSsr-MagHw", "author": "@aialra588", "comment_id": "UgyM2f5NoKCEqQQzGtx4AaABAg", "like_count": 0, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "really helpful，appreciate！"}
{"video_id": "5RSsr-MagHw", "author": "@bigpooper4156", "comment_id": "UgzfwaXhUWCH0MPjiW94AaABAg", "like_count": 1, "reply_count": 1, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Im glad I watched this before sending in my early decision application"}
{"video_id": "5RSsr-MagHw", "author": "@avpthegreat", "comment_id": "UgzfwaXhUWCH0MPjiW94AaABAg.9TtiuzBdVVp9TwGv-g7mQf", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgzfwaXhUWCH0MPjiW94AaABAg", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "As an alumni, you made the correct decision."}
{"video_id": "5RSsr-MagHw", "author": "@dennisonqu3225", "comment_id": "Ugw_Zh-p3GQ2QFCa3GR4AaABAg", "like_count": 0, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Great information"}
{"video_id": "5RSsr-MagHw", "author": "@opusmag1", "comment_id": "Ugw5S2n_UAF214u__3d4AaABAg", "like_count": 0, "reply_count": 2, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "I would have been to RPI with a 16000 scholarship, but I went to BU instead."}
{"video_id": "5RSsr-MagHw", "author": "@mayapatel8037", "comment_id": "Ugw5S2n_UAF214u__3d4AaABAg.9OQv9x__1V59dMDgDR1NGr", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "Ugw5S2n_UAF214u__3d4AaABAg", "published_date": "1 year ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "I'm a student deciding between the two, can I ask why you did this?"}
{"video_id": "5RSsr-MagHw", "author": "@opusmag1", "comment_id": "Ugw5S2n_UAF214u__3d4AaABAg.9OQv9x__1V59dMHhzLNCv3", "like_count": 0, "reply_count": 0, "is_reply": true, "parent_comment_id": "Ugw5S2n_UAF214u__3d4AaABAg", "published_date": "1 year ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": " @mayapatel8037  I was thinking on going to RPI for that scholarship, RPI medal, and higher chance of moving into PhD, but mom recommended me to move into BU because it officially has a premedical track unlike RPI. And yes, I agreed with my family as long as I can earn MD, I will do it. Thus, I had no choice but to go to BU and take classes there. In the end on whether I actually became a physician. No, by the time I'm supposed to be an MD student, I graduated in the end to UMass Boston with MassTransfer program, and now am Master's program in a local small grad school dedicated to psychological studies. :/"}
{"video_id": "5RSsr-MagHw", "author": "@michaellyga4726", "comment_id": "UgxWYHNywSPzBDVjqTx4AaABAg", "like_count": 1, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "1 year ago (edited)", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "I made a mistake going to RPI. At least we have puckman and no more Shirley."}
{"video_id": "5RSsr-MagHw", "author": "@vaughngreason2175", "comment_id": "UgwJhGXqaHzc4O3Du8F4AaABAg", "like_count": 5, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "Shit that's my best financial aid deal :/"}
{"video_id": "5RSsr-MagHw", "author": "@sharmanitascos", "comment_id": "UgwH4sfroxVvxOM8tcF4AaABAg", "like_count": 5, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "2 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "The president sounds like she should be fired immediately it sounds like she's destroying the university."}
{"video_id": "5RSsr-MagHw", "author": "@nyshvac", "comment_id": "UgwVsdVfIaGrW9tOTr14AaABAg", "like_count": 0, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "thankyou."}
{"video_id": "5RSsr-MagHw", "author": "@robcarme1424", "comment_id": "UgzbJ-8ikzWeN_vdOjJ4AaABAg", "like_count": 0, "reply_count": 0, "is_reply": false, "parent_comment_id": "", "published_date": "3 years ago", "crawled_date": "2023-10-29T22:57:47.459632", "is_video_owner": false, "comment": "F"}
