{"video_id": "9tsirvC4sSQ", "author": "@ChrisM-zm4li", "comment_id": "UgyrMzZ7vep4ND8QBx14AaABAg", "like_count": 0, "reply_count": 1, "is_reply": false, "parent_comment_id": "", "published_date": "4 months ago", "crawled_date": "2023-10-29T22:51:46.227795", "is_video_owner": false, "comment": "Hire a full time janitor, pay him well enough to live and give him benefits if you want the job done right and your research is so expensive and important. It was your fault for contracting the services out to save money. You caused the issue, and you also are encouraging the loss of real jobs with benefits and the ability to live like a respectable person, and not a pauper."}
{"video_id": "9tsirvC4sSQ", "author": "@John236-yu2us", "comment_id": "UgyrMzZ7vep4ND8QBx14AaABAg.9rWA_HeKltk9sDMPrT6QNW", "like_count": 11, "reply_count": 0, "is_reply": true, "parent_comment_id": "UgyrMzZ7vep4ND8QBx14AaABAg", "published_date": "3 months ago", "crawled_date": "2023-10-29T22:51:46.227795", "is_video_owner": false, "comment": "Did you seriously come to a school's admissions video to complain about something you're not involved in and dont understand? If you read any of the articles, you would know the fridge clearly had a note that stated in bold text 'this room does not need cleaning' and also gave detailed instructions on how to silence the alarm. You would also know the fridge had backup power and a lock box around its switch and outlet. The janitor went out of their way to literally mess w/ the buildings circuit breakers, and despite that, the school is not actually suing the individual, but rather, the company for not training them well. Sure, the school could have hired and trained their own janitor, but if you read any of what you speak of, you would know the school took plenty of precautions and did nothing unreasonable. RPI did not cause the issue. One should be able to assume when hiring a company to simply clean, their employees can 1. read, 2. follow instructions, 3. not mess with a buildings circuit breakers when they have zero qualifications to do so."}
